In [27]:
import pandas as pd

### Pandas Drop

Dropping in pandas means to remove rows or columns from your dataset.

Let's first create a DataFrame

In [28]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

#### Dropping Columns

I want to use this dataframe example mulitple times. So I'm going to create a copy first

In [29]:
df_drop_column = df.copy()

Now let's remove the "type" column from our dataset. We set our axis=1 to specify we are dropping columns

In [30]:
df_drop_column.drop("type", axis=1)

             name  AvgBill
0  Foreign Cinema    289.0
1       Liho Liho    224.0
2        500 Club     80.5
3      The Square     25.3

However, we could also set "columns" to equal the column(s) that we want to drop

In [31]:
df_drop_column.drop(columns='type')

             name  AvgBill
0  Foreign Cinema    289.0
1       Liho Liho    224.0
2        500 Club     80.5
3      The Square     25.3

If I wanted to drop multiple columns, say "type" & "AvgBill" then I could pass a list of columns to drop

In [32]:
df_drop_column.drop(["type", "AvgBill"], axis=1)

             name
0  Foreign Cinema
1       Liho Liho
2        500 Club
3      The Square

#### Dropping Rows

In [33]:
df_drop_rows = df.copy()

In order to drop rows, we need to specify labels *within the index* that we want to drop. Most of the time this will be row numbers, but double check your data!

In [34]:
df_drop_rows.drop(1, axis=0)

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

Again, we could also give a label or list of labels to "index" and pandas will know to remove rows (instead of columns)

In [35]:
df_drop_rows.drop(index=3)

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5

Or if we wanted to drop multiple items, we could pass a list of index labels

In [36]:
df_drop_rows.drop([1,2], axis=0)

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
3      The Square         bar     25.3

#### Surrpressing Errors

Say you accidentally reference a row or column that isn't in your dataset, this would normally raise an error. However you can surrpress this error by setting "errors" to 'ignore'

In [37]:
df_drop_column.drop("sample_non_existent_column", axis=1, errors='ignore')

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3